[{
    "id":"1",
    "subject":"Letter from Son 9-22-1977",
    "text":"Written while he was in the Nave to his mom and dad:\nDad, I love you and hope that you know that there is a bond between us and I feel it very strong.\nYou are like an umbilical cord, a spiritual one to me. I draw so much off of your example to love.\nI enjoy your letters. I look forward to our reunion in heaven where I can express my love for you to you. Dad, I love you. I only pray that I can do the will of the Lord and learn what I need to do.\nI love the Saints, all of them. I guess I love everyone and I want all of us to make it back to Heavenly Father. I look for the key that will show people the way for it is simple. Jesus said, 'I am the way, come follow me'. I am so glad for His love. I do love him.",
    "personId":"15",
    "author":"Kathy Ann Partridge"
},
{
    "id":"2",
    "subject":"Ordinance",
    "text":"Janet Gardner received her Endowment at age 16",
    "personId":"8",
    "author":"Diane Larsen"
},
{
    "id":"3",
    "subject":"Memories of Grandma Partridge",
    "text":"Grandma Partridge was the second wife of Grandpa Partridge. His first wife died while giving birth to\nher 2nd daughter. Grandpa's daughters were raised by their Grandparents who live in Cowley, Wyoming. The girls would visit their father during the summers. Grandma Partridge had two sons Uncle Bill and my father Dale. They lived in Parkman, Wyoming on the farm that was homesteaded by Grandma's father. Grandma cooked on an old wood stove. They had an outdoor toilet. They got their water from an old water pump. Grandma would heat up bricks on the stove to put at the bottom of their beds to keep their feet warm. It was a hard life but a good one. My father was a big help to his parents. Uncle Bill had hay fever and he wasn't able to do a lot of the farm work. Grandma was always busy taking care of teh home and helping Grandpa run the farm.\nWhen my dad got married he lived on a small farm next to his parents. My grandma loved to have us visit her. In the summer when grandpa was harvesting the hay Grandma would make homemade ice cream that was so good. Grandma had a garden that she took care of. She also had chickens and she would let us help her gather the eggs. They had an old rooster that was really mean. Grandma decided to chop off his head and have him for Sunday dinner. She also made her own butter from the cream that was separated from the milk. She had a root cellar where she could keep vegetables from the garden. She helped butcher the animals that would feed the family for the winter.",
    "personId":"15",
    "author":"Linda Lee Duke"
},
{
    "id":"4",
    "subject":"Edward Partridge Memorial",
    "text":"The Edward Partridge Memorial was dedicate August 30, 1997 in the Old Nauvoo Burial Groud.\n President James E. Faust gave the dedicatory prayer.\n As a committee we wish to express our appreciateion to all those who made this possible. We received about $11,000.00 from over\n 500 contributions. which represent over 3000 members of Grandpa\n Partridge's posterity. Please extend to your family our gratitude for\n their participation. We realize that some family members did not\n receive the information for which we apologize.\n This monument is a fitting tribute to Grandpa Partridge and his\n family. We have enclosed a copy of the program as a keepsake.\n Sincerely, the Edward Partridge Memorial Committee",
    "personId":"31",
    "author":"Tarali Finlinson"
},
{
    "id":"5",
    "subject":"Obituary",
    "text":"U.S. Veteran Mesquite, Nevada, H. Lynn Duke, age 85, passed away at his home Thursday\n morning Aprill 22, 2010. He was born October 28, 1924 in Draper, utah to Arthur Vance Duke and Eulean Garfield Duke. He grew up in Bench Creek, Heber Valley, and Wallsburg, Utah, and\n graduated from Wasatch High School spring of 1942. A World War II veteran, he served in the US\n Navy from November 1944 to June 1946. After the war he married his high school sweetheart Loa\n Whiting, daughter of William Arthur and Clara [Parcel] Whiting, on August 14, 1946, in the Salt\n Lake L.D.S. Temple. Seven children were born to this union.",
    "personId":"2",
    "author":"Penny Lee MCIntosh"
},
{
    "id":"6",
    "subject":"Memories of Dorothy Doreen Toombs Partridge",
    "text":"My grandmother came to Iowa when she was 3 years old from County Carlow, Ireland. She was a\n darling Irish Coleen and I loved her dearly. She was a marvelous cook and never failed to hav\n something delicious to eat whenever I went over to her house. Thanksgivings were always a treat\n at her place. I remember all the wonderful foods she served. I think in those days I loved fresh\n celery best. For my birthday grandma always made my favorite birthday cake, angel food cake.\n She was a very special grandma and I lvoed to visit her. Daddy's sisters were always good to us too and one of the special things I loved was to be given a nickel or a dime to go to Mitchel's\n Grocery Store. The penny candy was a delight to behold - chocolate secrets, green spearmint\n leaves, red licorice, suckers and believe me, a dime bought a large bag full. Also, on a hot\n summer day it was so much fun to go buy a milk nickel. They would simetimes have'free'\n written on the stick after you finished the ice cream. One day I got 4 free ones and felt like the\n richest kid in the world. My grandmother knew people from all over Pocatello and I loved to sit on\n the porch with them and listen to stories of by-gone-days.",
    "personId":"23",
    "author":"Jeanne Dalene Fulcher"
}
]